In [1]:
import pandas as pd
import numpy as np
import collections

3.1 : Creating a Dataframe

In [2]:
dictionary = {'Name': ['Jacky Jackson','Steven Stevenson'],
              'Age': [38, 25],
              "Driver": [True, False]}
dataframe = pd.DataFrame(dictionary)
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

Add Data to New Columns

In [3]:
dataframe['Eyes'] = ['Brown', 'Blue']
dataframe

               Name  Age  Driver   Eyes
0     Jacky Jackson   38    True  Brown
1  Steven Stevenson   25   False   Blue

3.2 : Getting Information about the Data

In [4]:
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'
dataframe = pd.read_csv(url)
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [5]:
dataframe.shape

(1313, 6)

In [6]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [7]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      1313 non-null   object
 1   PClass    1313 non-null   object
 2   Age       756 non-null    float64
 3   Sex       1313 non-null   object
 4   Survived  1313 non-null   int64
 5   SexCode   1313 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 61.7+ KB

3.3 : Slicing DataFrames

In [8]:
dataframe = pd.read_csv(url)

In [9]:
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

เลือกข้อมูลลำดับที่ 1 ถึง 3

In [10]:
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

เลือกข้อมูลลำดับที่ 0 ถึง 3

In [11]:
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [12]:
dataframe = dataframe.set_index(dataframe['Name'])
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                 29.0
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

Discussion

loc =  ใช้ดีก็ต่อเมื่อ index ใน dataframe เป็น  label (ex string)

iloc = ใช้เพื่อหาตำแหน่งใน dataframe

3.4 : Selecting Rows Based on Conditionals

In [13]:
dataframe = pd.read_csv(url)
dataframe [dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [14]:
dataframe[(dataframe['Sex']=='female') & (dataframe['Age']>=65)]

,Name,PClass,Age,Sex,Survived,SexCode
73,"Crosby, Mrs Edward Gifford (Catherine Elizabet...",1st,69.0,female,1,1

3.5 : Sorting Values

In [15]:
dataframe = pd.read_csv(url)
dataframe.sort_values(by=['Age']).head(2)

,Name,PClass,Age,Sex,Survived,SexCode
763,"Dean, Miss Elizabeth Gladys (Millvena)",3rd,0.17,female,1,1
751,"Danbom, Master Gilbert Sigvard Emanuel",3rd,0.33,male,0,0

3.6 Replacing Values

In [16]:
dataframe = pd.read_csv(url)
dataframe['Sex'].replace('female','Woman').head(2)

0    Woman
1    Woman
Name: Sex, dtype: object

In [17]:
dataframe['Sex'].replace(['female','male'],['Woman','Man']).head(5)

0    Woman
1    Woman
2      Man
3    Woman
4      Man
Name: Sex, dtype: object

In [18]:
dataframe.replace(1,"One").head(2)

                           Name PClass   Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female      One     One
1   Allison, Miss Helen Loraine    1st   2.0  female        0     One

In [19]:
dataframe.replace(r"1st","First", regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

3.7 : Renaming Columns

In [20]:
dataframe = pd.read_csv(url)
dataframe.rename(columns={'PClass':'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [21]:
dataframe.rename(columns={'PClass':'Passenger Class','Sex':'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

Discussion

In [22]:
column_names = collections.defaultdict(str)
for name in dataframe.columns:
    column_names[name]
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

3.8 : Finding the Minimun,Maximum,Sum,Average,and Count

In [23]:
dataframe = pd.read_csv(url)

print("Minimum Age:",dataframe['Age'].min())
print("Maximum Age:",dataframe['Age'].max())
print("Mean Age:",dataframe['Age'].mean())
print("Sum of Ages:",dataframe['Age'].sum())
print("Count of Ages:",dataframe['Age'].count())

Minimum Age: 0.17
Maximum Age: 71.0
Mean Age: 30.397989417989418
Sum of Ages: 22980.88
Count of Ages: 756

Discussion

In [24]:
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

3.9 : Finding Unique Values

In [25]:
dataframe = pd.read_csv(url)
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [26]:
dataframe['Sex'].value_counts()

Sex
male      851
female    462
Name: count, dtype: int64

Discussion

In [27]:
dataframe['PClass'].value_counts()

PClass
3rd    711
1st    322
2nd    279
*        1
Name: count, dtype: int64

In [28]:
dataframe['PClass'].nunique()

4

3.10 : Handling Missing Values

In [29]:
dataframe = pd.read_csv(url)
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

Discussion

In [30]:
dataframe = pd.read_csv(url,na_values=[np.nan,'NONE',-999])
null_entry = dataframe[dataframe['Age'].isna()].head(1)
print(null_entry)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1

In [31]:
null_entry.fillna(dataframe['Age'].mean())

                            Name PClass        Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  30.397989  female         1        1

3.11 : Deleting a Column

In [32]:
dataframe = pd.read_csv(url)
dataframe.drop(columns='Age',axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [33]:
dataframe.drop(['Age','Sex'],axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [34]:
dataframe.drop(dataframe.columns[1],axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

3.12 : Deleting a Row

In [35]:
dataframe = pd.read_csv(url)
dataframe[dataframe['Sex'] != 'male'].head(3)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

Discussion

In [36]:
dataframe[dataframe['Name'] != 'Allison, Miss Helen Loraine'].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [37]:
dataframe[dataframe.index != 0].head(2)

                                  Name PClass   Age     Sex  Survived  SexCode
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

3.13 : Dropping Duplicate Rows

In [38]:
dataframe = pd.read_csv(url)
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

Discussion

In [39]:
print("Number Of Rows In The Original DataFrame:", len(dataframe))
print("Number Of Rows After Dropping Duplicates:", len(dataframe.drop_duplicates()))

Number Of Rows In The Original DataFrame: 1313
Number Of Rows After Dropping Duplicates: 1313

In [40]:
dataframe.drop_duplicates(subset=['Sex'])

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [41]:
dataframe.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [42]:
dataframe.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
1308    False
1309    False
1310    False
1311    False
1312    False
Length: 1313, dtype: bool

3.14 : Grouping Rows by Values

In [43]:
dataframe = pd.read_csv(url)
dataframe.groupby('Sex').mean(numeric_only=True)

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

Discussion

In [44]:
dataframe.groupby('Sex')

In [45]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [46]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

3.15 : Grouping Rows by Time

In [48]:
time_index = pd.date_range('06/06/2017',periods=100000,freq='30S')
dataframe = pd.DataFrame(index=time_index)
dataframe['Sale_Amount'] = np.random.randint(1,10,100000)
dataframe.resample('W').sum()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15668\4020332183.py:1: FutureWarning: 'S' is deprecated and will be removed in a future version, please use 's' instead.
  time_index = pd.date_range('06/06/2017',periods=100000,freq='30S')

            Sale_Amount
2017-06-11        86244
2017-06-18       101110
2017-06-25       100822
2017-07-02       100322
2017-07-09       100178
2017-07-16        10412

Discussion

In [49]:
dataframe.head(3)

                     Sale_Amount
2017-06-06 00:00:00            7
2017-06-06 00:00:30            6
2017-06-06 00:01:00            5

In [50]:
dataframe.resample('2W').mean()

            Sale_Amount
2017-06-11     4.990972
2017-06-25     5.008234
2017-07-09     4.972718
2017-07-23     5.005769

In [51]:
dataframe.resample('M').count()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15668\3305436376.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [52]:
dataframe.resample('M',label='left').count()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15668\3908649215.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  dataframe.resample('M',label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

3.16 : Aggregating Operations and Statistics

In [53]:
dataframe = pd.read_csv(url)
dataframe.agg("min")

Name        Abbing, Mr Anthony
PClass                       *
Age                       0.17
Sex                     female
Survived                     0
SexCode                      0
dtype: object

In [54]:
dataframe.agg({'Age':['mean'],
               'SexCode':["min","max"]
               } )

            Age  SexCode
mean  30.397989      NaN
min         NaN      0.0
max         NaN      1.0

In [57]:
dataframe.groupby(
    ['PClass','Survived']).agg({'Survived':['count']}
    ).reset_index()

  PClass Survived
                  count
0      *        0     1
1    1st        0   129
2    1st        1   193
3    2nd        0   160
4    2nd        1   119
5    3rd        0   573
6    3rd        1   138

3.17 : Looping over a Column

In [58]:
dataframe = pd.read_csv(url)
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

Discussion

In [59]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

3.18 : Applying a Function over All Elements in a Column

In [60]:
dataframe = pd.read_csv(url)
def uppercase(x):
    return x.upper()
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

3.19 : Applying a Function to Groups

In [61]:
dataframe = pd.read_csv(url)
dataframe.groupby('Sex').apply(lambda x: x.count())

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_15668\3305176574.py:2: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

3.20 : Concatenating DataFrames

In [62]:
data_a = {'id': [1, 2, 3],
          'first':['Alex','Amy','Allen'],
          'last':['Anderson','Ackerman','Ali']}
dataframe_a = pd.DataFrame(data_a,columns=['id','first','last'])

data_b = {'id': [4, 5, 6],
          'first':['Billy','Brian','Bran'],
          'last':['Bonder','Black','Balwner']}
dataframe_b = pd.DataFrame(data_b,columns=['id','first','last'])

pd.concat([dataframe_a, dataframe_b],axis=0)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
0   4  Billy    Bonder
1   5  Brian     Black
2   6   Bran   Balwner

In [63]:
pd.concat([dataframe_a, dataframe_b],axis=1)

   id  first      last  id  first     last
0   1   Alex  Anderson   4  Billy   Bonder
1   2    Amy  Ackerman   5  Brian    Black
2   3  Allen       Ali   6   Bran  Balwner

3.21 : Merging DataFrames

In [64]:
employee_data = {'employee_id': [1, 2, 3, 4],
                 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tim Horton']}
dataframe_employee = pd.DataFrame(employee_data, columns=['employee_id', 'name'])

sales_data = {'employee_id': [3, 4, 5, 6],
              'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns=['employee_id', 'total_sales'])

pd.merge(dataframe_employee, dataframe_sales, on='employee_id')

   employee_id        name  total_sales
0            3  Alice Bees        23456
1            4  Tim Horton         2512

In [65]:
pd.merge(dataframe_employee, dataframe_sales, on='employee_id', how='outer')

   employee_id        name  total_sales
0            1   Amy Jones          NaN
1            2  Allen Keys          NaN
2            3  Alice Bees      23456.0
3            4  Tim Horton       2512.0
4            5         NaN       2345.0
5            6         NaN       1455.0

In [66]:
pd.merge(dataframe_employee, dataframe_sales, on='employee_id', how='left')

   employee_id        name  total_sales
0            1   Amy Jones          NaN
1            2  Allen Keys          NaN
2            3  Alice Bees      23456.0
3            4  Tim Horton       2512.0

In [67]:
pd.merge(dataframe_employee, dataframe_sales, left_on="employee_id", right_on="employee_id")

   employee_id        name  total_sales
0            3  Alice Bees        23456
1            4  Tim Horton         2512